# StructuralAnalyticalTessDeviation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAnalyticalTessDeviation Property
ParameterTypeId Class See Also
---
"Maximum discretized offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalyticalTessDeviation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalyticalTessDeviation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalyticalTessDeviation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace